-- ----------------------------
--  Change database
-- ----------------------------
USE `zo_healthy`;

SET NAMES utf8mb4;
-- SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Records of t_department
-- ----------------------------
INSERT INTO `t_department` VALUES ('40322777781112832', '', '2018-08-10 20:40:40', 0, 'admin', '2022-07-22 11:54:26', 0, 1.00, 0, '成都零壹星球健康体检中心', b'1');
INSERT INTO `t_department` VALUES ('1454369800754171904', 'admin', '2021-11-26 09:54:03', 0, 'admin', '2021-11-26 09:54:03', 40322777781112832, 1.00, 0, '问诊科', b'0');
INSERT INTO `t_department` VALUES ('1456585112434118656', 'admin', '2021-11-26 09:54:08', 0, 'admin', '2021-11-26 09:54:08', 40322777781112832, 1.00, 0, '五官科', b'0');
INSERT INTO `t_department` VALUES ('1456586147089223680', 'admin', '2021-11-26 09:54:13', 0, 'admin', '2021-11-26 09:54:13', 40322777781112832, 1.00, 0, '皮肤科', b'0');
INSERT INTO `t_department` VALUES ('1456834348874600448', 'admin', '2021-11-26 09:54:17', 0, 'admin', '2021-11-26 09:54:17', 40322777781112832, 1.00, 0, '骨密度', b'0');
INSERT INTO `t_department` VALUES ('1456834407368364032', 'admin', '2021-11-26 09:54:33', 0, 'admin', '2021-11-26 09:54:33', 40322777781112832, 1.00, 0, '肺功能', b'0');
INSERT INTO `t_department` VALUES ('1461588105466351616', 'admin', '2021-11-26 09:54:22', 0, 'admin', '2021-11-26 09:54:22', 40322777781112832, 1.00, 0, '总检科', b'0');
INSERT INTO `t_department` VALUES ('1461589634369851392', 'admin', '2021-11-26 09:54:26', 0, 'admin', '2021-11-26 09:54:26', 40322777781112832, 1.00, 0, '销售', b'0');
INSERT INTO `t_department` VALUES ('173', 'admin', '2021-11-26 09:52:57', 0, 'admin', '2021-11-26 09:52:57', 40322777781112832, 1.00, 0, 'DR室', b'0');
INSERT INTO `t_department` VALUES ('186', 'admin', '2021-11-26 09:53:03', 0, 'admin', '2021-11-26 09:53:03', 40322777781112832, 1.00, 0, '检验科', b'0');
INSERT INTO `t_department` VALUES ('188', 'admin', '2021-11-26 09:53:07', 0, 'admin', '2021-11-26 09:53:07', 40322777781112832, 1.00, 0, '妇科', b'0');
INSERT INTO `t_department` VALUES ('190', 'admin', '2021-11-26 09:53:11', 0, 'admin', '2021-11-26 09:53:11', 40322777781112832, 1.00, 0, '内科', b'0');
INSERT INTO `t_department` VALUES ('191', 'admin', '2021-11-26 09:53:16', 0, 'admin', '2021-11-26 09:53:16', 40322777781112832, 1.00, 0, '外科', b'0');
INSERT INTO `t_department` VALUES ('192', 'admin', '2021-11-26 09:53:21', 0, 'admin', '2021-11-26 09:53:21', 40322777781112832, 1.00, 0, '眼科', b'0');
INSERT INTO `t_department` VALUES ('193', 'admin', '2021-11-26 09:53:25', 0, 'admin', '2021-11-26 09:53:25', 40322777781112832, 1.00, 0, '口腔科', b'0');
INSERT INTO `t_department` VALUES ('194', 'admin', '2021-11-26 09:53:29', 0, 'admin', '2021-11-26 09:53:41', 40322777781112832, 1.00, 0, '心电图', b'0');
INSERT INTO `t_department` VALUES ('195', 'admin', '2021-11-26 09:53:41', 0, 'admin', '2021-11-26 09:53:41', 40322777781112832, 1.00, 0, '一般检查', b'0');
INSERT INTO `t_department` VALUES ('202', 'admin', '2021-11-26 09:53:45', 0, 'admin', '2021-11-26 09:53:45', 40322777781112832, 1.00, 0, '电测听', b'0');
INSERT INTO `t_department` VALUES ('204', 'admin', '2021-11-26 09:53:53', 0, 'admin', '2021-11-26 09:53:53', 40322777781112832, 1.00, 0, '彩超室', b'0');
INSERT INTO `t_department` VALUES ('207', 'admin', '2021-11-26 09:53:58', 0, 'admin', '2021-11-26 09:53:58', 40322777781112832, 1.00, 0, 'CT室', b'0');

-- ----------------------------
-- Records of t_user
-- ----------------------------
INSERT INTO `t_user` VALUES ('682265633886208', 'admin', '$2a$10$XO2oFI41ZOAemxx2Af1tgeKxmiyWFepb1yc5fW8IqZIZApWNkVcRO', '中', 1, 0, '系统初始化', '2023-12-26 15:18:32', NULL, NULL, '管理员', NULL, '男', '系统默认提供用户', 'admin@01xq.com', '18782059031', '四川省,成都市,武侯区', '天府一街', '1980-12-26 15:24:03', NULL, 40322777781112832, '成都零壹星球健康体检中心', 0);

-- ----------------------------
-- Records of t_section_office
-- ----------------------------
INSERT INTO `t_section_office` VALUES ('1454369800754171904', '013', '问诊科', 'wzk', 16, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-10-30 16:49:16', '682265633886208', '2022-03-23 22:07:04', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1456585112434118656', '014', '五官科', 'WGK', 13, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-11-05 19:32:08', '682265633886208', '2022-03-23 22:06:44', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1456586147089223680', '015', '皮肤科', 'PFK', 14, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-11-05 19:36:14', '682265633886208', '2022-03-23 22:06:51', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1456834348874600448', '016', '骨密度', 'GMD', 15, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-11-06 12:02:30', '682265633886208', '2022-03-23 22:06:57', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1456834407368364032', '027', '肺功能', 'FGN', 7, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-11-06 12:02:44', '682265633886208', '2022-03-23 22:04:46', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1461588105466351616', '030', '总检科', 'ZJK', 16.1, '', '', '职业体检,健康体检,从业体检', 0, '682265633886208', '2021-11-19 14:52:14', '682265633886208', '2022-03-23 22:07:25', NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1461589634369851392', '031', '销售', 'XS', 21, '', '', '职业体检,从业体检,健康体检', 0, '682265633886208', '2021-11-19 14:58:19', NULL, NULL, NULL, NULL, '186');
INSERT INTO `t_section_office` VALUES ('1499668825694670848', '017', '辅助检查科室', 'fzjcks', 17, '', '', '职业体检,健康体检', 0, '682265633886208', '2022-03-04 16:51:25', '682265633886208', '2022-03-04 16:52:09', NULL, NULL, '1461588105466351616');
INSERT INTO `t_section_office` VALUES ('173', '001', 'DR室', 'DRS', 5, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:04:27', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('1735860664548855808', '996', '007', 'OOS', 0, '', '', '职业体检', 0, '682265633886208', '2023-12-16 11:13:28', '682265633886208', '2023-12-18 14:48:44', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('186', '002', '检验科', 'JYK', 1, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:02:50', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('188', '003', '妇科', 'FK', 10.1, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:06:24', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('190', '004', '内科', 'NK', 9, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:05:25', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('191', '005', '外科', 'WK', 10, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:05:33', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('192', '006', '眼科', 'YK', 12, '', '', '健康体检,从业体检,职业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:05:52', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('193', '007', '口腔科', 'KQK', 11, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:05:43', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('194', '008', '心电图', 'XDT', 2, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:03:04', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('195', '009', '一般检查', 'YBJC', 8, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:05:18', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('202', '010', '电测听', 'DCT', 3, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:03:48', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('204', '011', '彩超室', 'CCS', 4, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:04:08', NULL, NULL, '40322777781112832');
INSERT INTO `t_section_office` VALUES ('207', '012', 'CT室', 'CT室', 6, '', '', '健康体检,职业体检,从业体检', 0, NULL, NULL, '682265633886208', '2022-03-23 22:04:34', NULL, NULL, '40322777781112832');

-- SET FOREIGN_KEY_CHECKS = 1;